---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RenderFailures.LightParametersNotInRange
source: html/07d6d05c-8515-c49e-3828-287c1f02068f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RenderFailures.LightParametersNotInRange Property

The value should be in range of [Value] and [Value].

## Syntax (C#)
```csharp
public static FailureDefinitionId LightParametersNotInRange { get; }
```